# Read design
read_verilog -I./include ./hdl/behavioral_parkingController.v

hierarchy -check -top behavioral_parkingController

# High level optimizaiton 
proc; opt; fsm; opt; memory; opt

# Map to RTLIL
techmap; opt

# mapping FFs to cmos_cells.lib
dfflibmap -liberty ./synth/cmos_cells.lib

# mapping logic to cmos_cells.lib
abc -liberty ./synth/cmos_cells.lib

# cleanup
clean

# Escribir diseño sintetizado
write_verilog ./synth/cmos_synth_parkingController.v
